package no1_slidingwindow.od.score_200;

/**
 * @ClassName P_00074
 * @Description
 * 给定一个矩阵，包含N*M个整数，和一个包含K个整数的数组现在要求在这个矩阵中找一个宽度最小的子矩阵，要求子矩阵包含数组中所有的整数。
 * 输入描述 第一行输入两个正整数N，M，表示矩阵大小。
 * 接下来N行M列表示矩阵内容。下一行包含一个正整数K。下一行包含K个整数，表示所需包含的数组，K个整数可能存在重复数字。
 * 所有输入数据小于1000。
 * 输出描述 输出包含一个整数，表示满足要求子矩阵的最小宽度，若找不到，输出-1
 *
 * 示例1
 * 输入
 * 2 5 1 2 2 3 1 2 3 2 3 2 3 1 2 3
 * 输出
 * 2
 * 说明
 * 矩阵第0、3列包含了1、2、3，矩阵第3、4列包含了1、2、3
 *
 * 示例2
 * 输入
 * 2 5 1 2 2 3 1 1 3 2 3 4 3 1 1 4
 * 输出
 * 5
 * 说明
 * 矩阵第1,2,3,4,5列包含了1,1,4
 *
 * @Author gm
 * @Date 2026/4/3 01:41
 */
public class P_00074 {
}
